Исходник/src/Catalogs/ТранспортныеСредства/ТранспортныеСредства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТранспортныеСредства</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Транспортные_средства_по_лизингу</name>
      <description>Транспортные средства по лизингу</description>
    </items>
  </predefined>
  <attributes>
    <name>Тип_тс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Объем_двигателя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Мощность_двигателя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Дата_выпуска</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>График_прохождения_отс</name>
    <attributes>
      <name>Дата_прохождения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Исходник/src/InformationRegisters/ИсторияТС/ИсторияТС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИсторияТС</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Значение</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <dimensions>
    <name>ТранспортныеСредства</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Исходник/src/Catalogs/ТранспортныеСредства/Forms/ФормаСписка1/Module.bsl
Функция ПолучитьЗначениеПериодическогоРеквизита(ТранспортныеСредства)
	Возврат РегистрыСведений.ИсторияТС.ПолучитьПоследнее(ТекущаяДата(), Новый Структура("ТранспортныеСредства", ТранспортныеСредства)).Значение;
КонецФункции

&НаКлиенте
Процедура Справка(Команда)
	СправкаНаСервере();
КонецПроцедуры

&НаСервере
Процедура СправкаНаСервере()
	// Вставить содержимое обработчика. 
	Спр = Справочники.ТранспортныеСредства.Выбрать();
	Пока Спр.Следующий() Цикл
		// Группы справочника пропускаются
		Если Спр.ЭтоГруппа или Спр.Объем_двигателя >= 40 Тогда
			Продолжить;
		КонецЕсли;
		Сообщить(Спр.Наименование);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	ПечатьНаСервере().Показать("Список автомобилей");
КонецПроцедуры

&НаСервере
Функция ПечатьНаСервере()
	ТабДок = Новый ТабличныйДокумент(); 
	Макет = Справочники.ТранспортныеСредства.ПолучитьМакет("Макет");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапка.Параметры.Дата =
	// Форматирование даты
	Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy");
	ТабДок.Вывести(ОбластьШапка);
	ТабДок.НачатьАвтогруппировкуСтрок();
	Спр = Справочники.ТранспортныеСредства.ВыбратьИерархически();
	Пока Спр.Следующий() Цикл
		Если Спр.ЭтоГруппа Тогда
			ОбластьГруппа = Макет
			.ПолучитьОбласть("Группа");
			ОбластьГруппа.Параметры.Заполнить(Спр);
			// Заполнение параметра расшифровки
			ОбластьГруппа.Параметры.СсылкаГруппа =
			Спр.Ссылка;
			ТабДок.Вывести(ОбластьГруппа,
			Спр.УровеньВВыборке());
		Иначе
			ОбластьЭлемент = Макет
			.ПолучитьОбласть("Элемент");
			ДатаВыпуска = Спр.Дата_выпуска;
			СколькоЛет = Год(ТекущаяДата()) - Год(ДатаВыпуска);
			ОбластьЭлемент.Область("R1C3").Примечание.Текст = Спр.Наименование + " уже " + СколькоЛет + " лет";
			ОбластьЭлемент.Параметры.Заполнить(Спр);
			ОбластьЭлемент.Параметры.Водитель = ПолучитьЗначениеПериодическогоРеквизита(Спр.Ссылка);
			ТабДок.Вывести(ОбластьЭлемент, 
			Спр.УровеньВВыборке(), 
			Спр.Владелец, Ложь);
		КонецЕсли;
	КонецЦикла;
	ТабДок.ЗакончитьАвтогруппировкуСтрок(); 
	
	ТабДок.ТолькоПросмотр = Истина;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.ОтображатьСетку = Ложь; 
	Возврат ТабДок;
КонецФункции
